<!--
 * @Description: 
 * @Author: 曹俊
 * @Date: 2022-09-17 20:02:24
 * @LastEditors: 曹俊
 * @LastEditTime: 2022-09-21 10:41:06
-->
<template>
  <div class="bg-hex-f6f7f9 w-95% pt-2">
    <div
      class="bg-white p-2 h-100% border-hex-ccc rounded-lg indent text-left text-14px mb-15"
    >
      <p>
        Hello,这个应用是移动端应用，如果你是在电脑上打开的话，请你打开开发者选项，然后点击那个手机标志，即可正常显示应用。
      </p>
      <p>
        此外，由于页面繁多，实在是写不过来，然后就是加上网易云音乐接口的不稳定，导致该项目有很多东西不够完善，比如登录，我写了四种登录方式：
        手机号+验证码，手机号+密码，邮箱登录，验证码登录，其中，前三种登录方式让我头疼了好几天，因为真的不稳定，所以只能在移动端应用加上扫码登录，
        所以，请你们不要嫌麻烦，先截个屏，然后用手机的网易云音乐扫一下码，登录即可，如果二维码过期的话，请刷新一下页面。还有就是点击歌曲的时候需要
        动动你的手指，点击一下播放，因为如果让它自动播放的话，会有很多意想不到的bug，最后补充以下几点：
      </p>
      <p>
        需要登录的部分：每日推荐，私人FM(暂时还没有写完歌词部分)，我的。点击左上角或者我的即可登录
      </p>
      <p>未完成的部分：MV播放，我收藏的歌单，编辑个人资料等</p>
      <p>有什么问题欢迎email me--2406001659@qq.com or --18773507481@163.com</p>
    </div>
  </div>
</template>

<script setup lang="ts"></script>

<style scoped></style>
